package java_b3_1205;

public class Txt_1205 {
    // 이름 뒤 - 메서드
    // 클래스 명 뒤 -생성자
    // 디폴트 생성자 - 즉 파라미터가 없는 생성자
    // 파라미터가 있는 생성자가 있음 - 같은 이름의 생성자가 여러개 올 수 있다.
    
    // Wrapper Class
    // why? primitive type은 변수와 메서드를 소유할 수 없으므로 primitive type에 대응하는 class가 필요하다.
    // 값을 갖는데 연산자 재료
    
    // 메서드에는 두 가지 컨벤션 리턴타입과 파라미터
    // API 보는 방법
    // (type).instance of 형 변환, 객체타입검사 객체에 대한 타입을 검사한다.
    
    // 코드의 양은 늘어나더라도 복잡도는 늘어나서는 안 된다.
    
    //컴파일 에러
    //런타임에러 - 런타임에러 찾기가 어려움
    
    //&,&& 두 조건 모두 참일때만 실행문이 실행됨
    
    //data에 대한 접근 data에 담긴 값의 상태 
    
    //출력 위치에 따른 차이점

}
