package b3_1207;

public class Txt_1207 extends Object {
    
    // 12월 8일 
    // 1교시 문제해결 시나리오
    // 문제해결 능력 원인, 문제점을 찾고 해결방안을 작성하시오.
    // 2교시 서술형: 원시형, 참조형, 타입, 변수&상수, 형변환, 연산자 ( 전위, 후위, 단항, 논리, 우선순위), 반복문, 
        
    // 상속 (inheritance) - 확장, 재사용(over riding의 경우)
    
    // src review, code 분석
    // week review - variable, parameter, instance, Encapsulation
    
    // Array는 class급
    // 동일한 자료형(Data Type)의 data를 연속된 공간에 저장하기 위한 자료구조
    // 연관된 데이터를 저장하기 위한 변수의 선언을 줄여주며
    // 반복문 등을 이용하여 계산과 같은 과정을 쉽게 처리할 수 있다.
    
    // 배열의 단점
    // 같은 data type만 담을 수 있다.
    // 중간에 끼워넣기 불가
    // 원소의 개수 고정 - 변경 불가
    
    // 배열은 선언과 생성을 나누어 처리할 수 있다.
    // 이른 주입인가 아니면 게으른 주입인가
    // 이른 인스턴스화는 선언부에 선언과 생성을 한 번(한 문장으로)에
    // int[] arr1 = new int[3];
    // 배열 이름의 주소번지와 첫번째 index의 주소번지는 같다. 그래서 index 시작이 0이다.
    
    // 게으른 인스턴스화는 선언과 생성을 분리한다.
    
    // 변수 - 원시배열 - 객체배열 - 자료구조(List, Map) - 쿠키와 세션
    // List는 배열의 형태를 띠고 있음
    
    //생성자의 제 1역할은 전역변수의 초기화이다.
    
}
